labwork11/src/Documents/ВозвратЭлектросамоката/ВозвратЭлектросамоката.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВозвратЭлектросамоката</name>
  <basedOn>Document.СдачаВАренду</basedOn>
  <registerRecords>AccumulationRegister.ОстаткиЭлектросамокатов</registerRecords>
  <registerRecords>AccumulationRegister.АрендаЭлектросамоката</registerRecords>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Электросамокат</name>
    <type>
      <types>CatalogRef.Электросамокаты</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.СдачаВАренду</types>
    </type>
  </attributes>
</mdclass:Document>

labwork11/src/AccumulationRegisters/ОстаткиЭлектросамокатов/ОстаткиЭлектросамокатов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиЭлектросамокатов</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Электросамокат</name>
    <type>
      <types>CatalogRef.Электросамокаты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

labwork11/src/AccumulationRegisters/АрендаЭлектросамоката/АрендаЭлектросамоката.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>АрендаЭлектросамоката</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Электросамокат</name>
    <type>
      <types>CatalogRef.Электросамокаты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

labwork11/src/Documents/ВозвратЭлектросамоката/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения,СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СдачаВАренду") Тогда
		// Заполнение шапки
		Студент = ДанныеЗаполнения.Студент;
		Электросамокат = ДанныеЗаполнения.Электросамокат;
		Основание = ДанныеЗаполнения.Ссылка;

	КонецЕсли;

	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ

КонецПроцедуры
Процедура ОбработкаПроведения(Отказ,Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр ОстаткиЭлектросамокатов
	Движения.ОстаткиЭлектросамокатов.Записывать = Истина;
	Движение = Движения.ОстаткиЭлектросамокатов.Добавить();
	Движение.Период = Дата;
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Электросамокат = Электросамокат;
	Движение.Количество = 1;

	// регистр АрендаЭлектросамоката
	Движения.АрендаЭлектросамоката.Записывать = Истина;
	Движение = Движения.АрендаЭлектросамоката.Добавить();
	Движение.Период = Дата;
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Студент = Студент;
	Движение.Электросамокат = Электросамокат;
	Движение.Количество = 1;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
